Repository: xulihang/BasicCAT_docs_en_translation
Catalog: tm_2018_12_16.tmx
Source language: zh
Languages: en

source: BasicCAT 使用手册
en: BasicCAT Documentation

source: BasicCAT会根据片段修改的时间自动解决冲突，基本不会发生冲突的情况。
en: BasicCAT automatically resolves conflicts according to the creation time of segment's translation. You will almost encounter no conflicts.

source: BasicCAT会记录片段的修改历史，点击菜单Edit->Show segment history即可查看历史，其中的用户名即版本控制设置中添加的用户名。
en: BasicCAT will record segment history. Click the menu Edit->Show segment history to view the history, where the user name is the user name added in the version control settings.

source: BasicCAT分别读取designmap.xml文件和Spreads文件，获得story文件在原文中的显示顺序，然后对其文本进行提取。
en: BasicCAT reads designmap.xml and spreads files to get the order of stories shown in the document and extracts texts from story files.

source: BasicCAT利用 `Language Tool <https://www.languagetool.org/>`_ 作为语言检查的后端。
en: BasicCAT uses `Language Tool <https://www.languagetool.org/>`_ to check language errors.

source: BasicCAT利用SRX分割标准对原文进行分割。
en: BasicCAT uses the SRX segmentation standard to segment the text.

source: BasicCAT利用opennlp自然语言处理工具对词型进行还原，避免保存的是词语的复数形式而匹配不到词语的单数形式等问题。
en: BasicCAT uses opennlp to lemmatize words. So, if you add a term in its plural form, BasicCAT can detect its singular form in another segment.

source: BasicCAT可以在本地生成git仓库，添加remote uri和账号密码后即可把本地的记录上传到远程，并与其它用户进行协作。
en: BasicCAT can build a local git repository and upload it to a remote repository when the remote uri and account info are set.

source: BasicCAT对不需要显示的格式标签进行了隐藏处理，如果合并的片段带标签，也会进行提示。
en: BasicCAT hides format tags when possible. So if segments contain hidden tags, there will be a message box as below.

source: BasicCAT并没有直接支持Word文档，但可以通过okapi将word转换为xliff来进行翻译。
en: BasicCAT does not directly support Word documents, translation. We can use okapi to convert docx to xliff to translate.

source: BasicCAT支持定义快速填充项目，在翻译时使用快捷键Ctrl+Q或者点击菜单Edit->Show quickfill dropdown来显示快捷输入用的下拉列表。
en: BasicCAT supports quickfill. You can use the shortcut key CTRL+Q or click the menu "Edit-show quick fill dropdown" to display a dropdown list of quickfill items.

source: BasicCAT支持导出翻译的内容至Word中，利用Word的审校功能进行审校。
en: BasicCAT can export translated contents to docx files and use Word to review.

source: BasicCAT支持自动备份，可以在设置界面设置间隔多少时间备份一次项目文件。
en: BasicCAT supports auto backup. You can set up its time interval.

source: BasicCAT是一款开源的计算机辅助翻译软件，旨在为译员提供简单实用的翻译工具。
en: BasicCAT is an open source computer-aided translation tool, which aims at providing a simple and useful tool for translators.

source: BasicCAT的翻译记忆库分为项目记忆库和外部记忆库。
en: There are two types of translation memory in BasicCAT. One is project memory and one is external memory.

source: BasicCAT目前支持开发机器翻译插件和文件过滤器插件。
en: BasicCAT currently supports two kinds of plugins. One is machine translation plugin and the other is filter plugin.

source: BasicCAT自带了PDF转文字的工具，可以通过菜单栏Tools->PDF2TXT打开。
en: BasicCAT has a PDF to Text tool. It can be accessed by menu "Tools->PDF2TXT".

source: BasicCAT自带的Git，支持每次执行保存时在项目文件夹执行一次git commit操作。
en: BasicCAT comes with git and can execute git add and git commit every time the project is saved.

source: BasicCAT里翻译好后导出翻译记忆，导入Felix。
en: After the translation is done, export the translation memory to TMX and import it into Felix.

source: BasicCAT预置了以下9种机器翻译引擎的API的支持：
en: BasicCAT has a built-in support for 7 machine translation services:

source: CAT软件利用这一格式存储从docx、html、idml等格式文件提取出来的文本，翻译完成后再利用这一格式文件生成目标文件。
en: CAT tools often use this format to store extracted text from files like docx, html and idml. When translation is done, CAT tools will generate target files based on XLIFF files.

source: Felix是微软Office上运行的一套宏，可以在Word中利用翻译记忆完成翻译，一切操作都在Word中进行。
en: Felix is a set of macros running on Microsoft Office. You can translate directly in Word and use translation memory.

source: Fonts.xml保存了字体信息，Styles.xml保存了样式信息。
en: Fonts.xml stores font info and Styles.xml stores styles info.

source: GitHub操作示例
en: Using GitHub

source: GitHub是一个流行的Git托管平台，我们可以基于它进行协作。
en: GitHub is a popular Git hosting platform. We can collaborate upon it.

source: IDML其实是一个zip压缩文件，里面的文件结构如下：
en: An IDML file is a compressed file in nature. Its structure is as follows.

source: IDML文件
en: IDML Files

source: IDML文件中的样式分为全局样式和本地样式，全局样式存储在styles.xml文件中，story文件通过AppliedParagraphStyle和AppliedCharacterStyle保存对应的全局样式名，而本地样式被定义在属性和Properties元素里，比如PointSize、FontStyle等。
en: There are two types of style in IDML. One is global style and the other is local style. Global styles are stored in Styles.xml. Story files use AppliedParagraphStyle and AppliedCharacterStyle attributes to mark global styles. Local styles are defined in the attributes and the properties element in story files, like PointSize and FontStyle.

source: IDML是Adobe InDesign使用的基于XML的文件格式。
en: IDML is an XML based file format used by Adobe InDesign.

source: Language Tool是一款开源的拼写和语法检查器。
en: Language Tool is an open source spelling and grammar checker.

source: Linux和macOS(homebrew)用户可以直接安装tesseract-ocr这个包，并下载对应语言的模型文件。
en: Linux and macOS(with homebrew) users can install tesseract-ocr directly. You may need to download extra language models.

source: Markdown文件可以使用\\ `Pandoc <http://www.pandoc.org/>`_\\ 进一步转换成Word文件。
en: Markdown files can be converted to word files later using `Pandoc <http://www.pandoc.org/>`_.

source: MyMemory每天10000词；
en: MyMemory has a limit of 10,000 words per day;

source: PDF中的文字是没有段落信息的，所以默认提取出来的每行文字后面都有回车，PDF2TXT提供一个reflow功能，可以自动去除多余的回车。
en: Texts in PDF do not have paragraph info. They are just fixed dots in a page. The extracted text may have newline at the end of each line. PDF2TXT provides "reflow" function to remove extra newlines.

source: PDF文件
en: PDF Files

source: PDF文件往往是由另一种格式的文件生成的，比如docx、idml等，如果能找到源文件是最好的。
en: PDF files are often generated by files in another format, such as docx, idml, etc. It's better to handle the source file directly.

source: PDF文件是较难处理的格式，可以用Word、ABBYY、Solid Document Converter等工具将其转换为Word，但原来的格式往往不能得到很好的保留。
en: PDF file is a difficult format to process. It can be converted to docx by tools such as Word, ABBYY, Solid Document Converter, etc. But the original format cannot be well preserved.

source: PO文件
en: PO Files

source: PO是和xliff类似的一种格式，最初是GNU用来本地化C语言程序的。
en: PO is a format similar to XLIFF. It is designed to localize C programs at first.

source: XLIFF利用继承自opentag的抽象占位符标签和继承自tmx的封装标签来表示特殊样式。
en: XLIFF uses abstract placeholder tags inherited from opentag and encapsulating tags inherited from TMX to represent special formats.

source: XLIFF文件
en: XLIFF Files

source: XLIFF是OASIS组织制定的标准，可以作为一种中间格式，在不同的翻译软件之间使用。
en: XLIFF is a standard formulated by the OASIS organization and can be used as an intermediate format between different translation software.

source: XLIFF是处理提取出来的待翻译文本的一种XML格式。
en: XLIFF is an XML format for processing extracted text to be translated.

source: Yandex每天1百万词，每月不超1千万词。
en: Yandex has a limit of 1million words per day and 10million words per month.

source: `BasicCAT <https://github.com/xulihang/BasicCAT/>`_ 是遵循GPLv2协议的开源项目，欢迎大家为项目做贡献。
en: `BasicCAT <https://github.com/xulihang/BasicCAT/>`_ is an open source project licensed under GPLv2. Contributions to help BasicCAT grow are appreciated.

source: `LanguageTool 4.3 下载 <https://www.languagetool.org/download/LanguageTool-4.3.zip>`_
en: `LanguageTool 4.3 Download <https://www.languagetool.org/download/LanguageTool-4.3.zip>`_

source: `Okapi <http://okapiframework.org/>`_ 是一套开源跨平台的翻译组件。
en: `Okapi <http://okapiframework.org/>`_ is a set of translation components.

source: `在此 <http://okapiframework.org/wiki/index.php?title=Filters>`_ 查看Okapi支持的文件格式。
en: Visit `here <http://okapiframework.org/wiki/index.php?title=Filters>`_ to see what formats Okapi supports.

source: `小牛 <https://niutrans.vip/index/niutrans/index.html>`_
en: `Niutrans <https://niutrans.vip/index/niutrans/index.html>`_

source: `微软必应 <https://azure.microsoft.com/services/cognitive-services/translator-text-api/>`_
en: `Microsoft Bing <https://azure.microsoft.com/services/cognitive-services/translator-text-api/>`_

source: `搜狗 <http://ai.sogou.com/ai-docs/api/fanyi>`_
en: `Sogou <http://ai.sogou.com/ai-docs/api/fanyi>`_

source: `有道 <http://ai.youdao.com/>`_
en: `Youdao <http://ai.youdao.com/>`_

source: `点此下载思源宋体 <https://github.com/adobe-fonts/source-han-serif/releases/download/1.001R/SourceHanSerif.ttc>`_
en: `Download Source Han Serif <https://github.com/adobe-fonts/source-han-serif/releases/download/1.001R/SourceHanSerif.ttc>`_

source: `百度 <http://api.fanyi.baidu.com/api/trans/product/prodinfo>`_
en: `Baidu <http://api.fanyi.baidu.com/api/trans/product/prodinfo>`_

source: `腾讯翻译君 <https://ai.qq.com/doc/nlptrans.shtml>`_
en: `Tencent <https://ai.qq.com/doc/nlptrans.shtml>`_

source: `谷歌 <https://cloud.google.com/translate/>`_
en: `Google <https://cloud.google.com/translate/>`_

source: c0对应的是默认的没有特殊格式的样式，所以BasicCAT在显示的原文中对其进行隐藏。
en: c0 is the default style that has no special formats. BasicCAT will hide it in the source text shown.

source: designmap.xml是整个文件的大纲，spread文件是每个页面的结构，story文件则是spread里文本框存储的文本。
en: designmap.xml defines the document's basic structure. A spread file includes the structure of one page or facing pages. A story file contains the text shown in a textframe.

source: idml中的标签不是必须翻译的，如果不翻，BasicCAT会自动补充c0标签，保证译文不被忽略。
en: Translation of tags in IDML is not necessary. If there is no corresponding tags in target texts, c0 tags will be filled to make sure the translation will not be omitted.

source: msgctxt后面是上下文信息，msgid存储原文内容，msgstr存储译文内容。
en: msgctxt stores context info. msgid stores the source text and msgstr stores the target text.

source: okapi生成的PO也使用了标签来表示特殊样式。
en: PO files created by okapi also uses tags to represent formats.

source: txt纯文本文件没有额外的标签信息，所有片段都支持合并与拆分。
en: TXT files are pure text files. There are no extra tags and all the segments can be merged and splitted.

source: word中的不同段落，indesign中不同的story文件都属于这种情况。
en: Different paragraphs in Word and different stories in InDesign belong to such case.

source: 一般InDesign的文件都保存为indd。indd是专有格式，不能被第三方软件进行解析，所以要翻译InDesign文件需要先将其转换为IDML文件。
en: InDesign's default file format is indd, which is a proprietary format. It cannot be opened by third-party applications. In order to translate InDesign documents, Indd files have to be converted to IDML files.

source: 上例中 ``p16`` ， ``c0`` 中的数字对应的styles.xml文件中某个全局样式的顺序。
en: The numbers in ``p16`` , ``c0`` correspond to the rank of some global style in styles.xml.

source: 上述内容在BasicCAT中是这样显示的，和xliff一样，对片段中的开头结尾处的成对标签或单个标签进行了隐藏：
en: Below is how it looks when translating the PO file in BasicCAT. Like XLIFF, Single tag and paired tags at both sides of the segment will be hidden.

source: 上述内容在BasicCAT中是这样显示的，对片段中开头结尾处的成对标签或单个标签进行了隐藏：
en: When the XLIFF file is opened by BasicCAT, the result looks like below. Single tag and paired tags at both sides of the segment will be hidden.

source: 上面的story文件，BasicCAT将其转换为以下带标签的文本。
en: BasicCAT will convert the story file above into the tagged text below.

source: 下载后解压至任意位置，然后打开BasicCAT，点击菜单Tools->Server Launcher，打开服务启动器的窗口，选择存放languagetool-server.
en: Unzip the downloaded, open BasicCAT, click menu "Tools->Server Launcher", and you can setup the path to the folder containing the file named languagetool-server.jar.

source: 下载后解压至任意位置，然后打开BasicCAT，点击菜单Tools->Server Launcher，打开服务启动器的窗口，选择存放languagetool-server.jar这一文件的文件夹。
en: Unzip the downloaded, open BasicCAT, click menu "Tools->Server Launcher", and you can setup the path to the folder containing the file named languagetool-server.jar.

source: 下载完成后解压corenlp-full的zip文件到任意位置，把中文模型文件放入解压的目录，然后点菜单Tools->Server Launcher，选择文件夹位置后点Start CoreNLP Server按钮启动。
en: Unzip CoreNLP and put the Chinese model jar in the same folder. Use Server Launcher to start the server.

source: 下面是一个Story文件的内容：
en: Below is what a story file looks like:

source: 下面是利用正则表达式将英文引号替换成中文引号的例子。
en: Below is an example of replacing English quotation marks to Chinese quotation marks.

source: 下面讲讲如何利用BasicCAT翻译docx的文本，然后利用felix进行回填。
en: Here is how we use BasicCAT to translate the text of docx files and use Felix to fill the translation in Word.

source: 之后将这个项目分发给其它用户即可。
en: Then, you can package the project to other translators.

source: 之后用BasicCAT打开一个项目，在项目设置-团队协作里设置远程仓库。
en: Use BasicCAT to open a project and set the remote repository.

source: 交互式机器翻译
en: Interactive Machine Translation

source: 从源文件生成xliff或者po文件
en: Create XLIFF or PO files from source files

source: 从生成的项目导出目标文件
en: Generate target files from the previously created okapi project

source: 以下是教程idml部分的范例文件用okapi提取出来的po文件的内容：
en: Below is PO content extracted by okapi from the example IDML story file.

source: 以下是教程idml部分的范例文件用okapi提取出来的xliff文件的内容：
en: Below is the XLIFF extracted by okapi from the story file example in IDML part.

source: 但是抽象之后，原文标签中的含义也被隐去了。
en: But after this abstraction, we cannot tell what function this tag has.

source: 你也可以用git reset命令回退到之前的历史版本。
en: You can use git reset to return to a previous version.

source: 你也可以通过菜单手动进行git的相关操作。
en: You can also use the menu to manually do git actions.

source: 你可以一条一条地重新确认，也可以直接用审校的内容替换原来的翻译。
en: You can check the imported result one by one or replace the original translation with the review directly.

source: 你可以修改程序所在目录下key.txt来添加一个访问密钥。
en: You can modify the key.txt in program's folder to setup an access key.

source: 你可以通过修改项目文件夹下的config文件夹里的dictList.txt添加其它在线词典。
en: You can add other online dictionaries by modifying the dictList.txt in the project's config folder.

source: 你需要在偏好设置里先设置好git账户。
en: You need to setup git accounts in preference settings first.

source: 使用Git进行版本控制
en: Version Control Using Git

source: 共享翻译记忆、术语
en: Sharing translation memory and term

source: 关于felix的操作，可以访问\\ `官网 <http://felix-cat.com/>`_\\ 或者阅读这篇文章：`在Office里运行的CAT软件 <http://blog.xulihang.me/CAT-Tools-work-with-microsoft-office/>`_ 。
en: About how to use Felix, visit its `homepage <http://felix-cat.com/>`_ to learn more.

source: 关于tesseract的安装，Windows可以 `在此 <https://pan.baidu.com/s/1Pij20PPfVLUqXcBGc4ueSg>`_ 下载一份程序，运行PDF2TXT时会提示设置tesseract的路径，选择即可。
en: About the installation of tesseract, Windows users can download a copy from `here <https://pan.baidu.com/s/1Pij20PPfVLUqXcBGc4ueSg>`_\ . PDF2TXT will ask for the path to tessearct.exe.

source: 关于正则表达式，可以参考\\ `这里 <http://www.runoob.com/regexp/regexp-tutorial.html>`_\\ 的教程。
en: You can learn more about regular expressions at this `website <http://www.runoob.com/regexp/regexp-tutorial.html>`_\ .

source: 其中c3标签对文字进行了加粗。
en: c3 tag add bold font style to the text.

source: 其它
en: Other

source: 其它用户要想修改远程仓库，还需要获得push的权限。
en: Other translators need to have their own GitHub account and be authorized push permission to the repository.

source: 其它需要付费使用，小牛和有道注册时会附赠百万词的额度。
en: Other services are paid services. Niutrans and youdao will give away 1million words upon registry.

source: 其对应关系如下：
en: Font weight's names of English fonts will be converted to names in Source Han Serif as follows.

source: 划词取义
en: Select words to get meanings

source: 划词检索和自动完成功能需要至少配置一个机器翻译才能使用。
en: You need to set up at least one machine translation to use selecting words to get meanings and autocomplete functions.

source: 利用Alt+G快捷键，可以快速地进行译文的替换。
en: You can use the shortcut key ALT+G to quickly fill translations.

source: 利用BasicCAT的服务器端程序，可以架设用于共享翻译记忆和术语的服务。
en: The BasicCAT's server program is needed to setup a translatin memory and term sharing service.

source: 利用Felix翻译Word文件
en: Using Felix to Translate Word Files

source: 利用Okapi翻译其它格式文件
en: Using Okapi to Translate Files in Other Formats

source: 利用机器翻译和在线词典API，BasicCAT提供划词检索功能。
en: BasicCAT can show the meanings of selected text based on machine translation and online dictionary.

source: 匹配率须在0.5到1.0之间。
en: The rate should be between 0.5 to 1.0.

source: 占位符标签：
en: Abstract placeholder:

source: 取名BasicCAT，一是因为它简单易用，二是因为它使用Basic语言编写，普通人花上一段时间学习后也能掌握，从而在BasicCAT源代码的基础上修改出适合自己需要的软件。
en: The name is BasicCAT, because of its simplicity and its programming language—Basic. Basic is easy to learn and everyone can build a suitable CAT tool based on BasicCAT's source code.

source: 句段分割与合并
en: Merge and split segments freely

source: 另一种方式则是使用Felix CAT。
en: Another way is to use Felix CAT.

source: 另外段落标签和文本内容为非文本的标签也可以进行隐藏。
en: Paragraph tags and tags without texts can also be hidden.

source: 可以在设置里设置执行git commit的用户信息。
en: You can set git commit's user information in Preferences.

source: 可以用浏览器访问 `<http://127.0.0.1:8081/v2/check?text=a%20example&language=en-US>`_ 来判断服务是否运行。
en: You can visit `<http://127.0.0.1:8081/v2/check?text=a%20example&language=en-US>`_ to check whether the server is running.

source: 可以用浏览器访问 `<http://127.0.0.1:9000>`_ 来判断服务是否运行。
en: Visit `<http://127.0.0.1:9000>`_ to see whether the server is running.

source: 可以设置翻译记忆的最低匹配率和选择使用哪个机器翻译引擎。
en: You can set the lowest match rate and which machine translation service to use.

source: 可以通过点击菜单Edit->Mark the current segment as non-translatble进行设置。
en: Use Menu Edit->Mark the current segment as non-translatable to do this.

source: 含有备注的片段的译文编辑框会显示一圈绿色。
en: Segments containing notes will have textarea with gray border.

source: 和Language Tool一样，还需要设置启用自动完成。点击菜单Options->Preferences，进入Autocomplete页面，勾选启用自动完成。
en: Like setting Language Tool, you also need to check the "Enable Autocomplete" checkbox to use autocomplete.

source: 和上一条操作办法相近，在所需导出的文件上右键，点击Export to->Markdown with notes，可以导出Markdown文件。
en: Like the previous export, right click on the filename and click export to->markdown with notes to get a markdown file.

source: 因为离线词典往往具有版权问题，所以BasicCAT选择了集成在线词典。
en: BasicCAT integrates online dictionaries as offline dictionaries have copyright issues.

source: 团队协作
en: Collaboration

source: 在BasicCAT中翻译xliff中带格式的内容时，会显示各种标签内容。
en: When translating XLIFF files, there will be tags in the source text.

source: 在一个片段翻译完成，按下回车切换到下一片段后，会对上一片段进行检查。
en: When a segment is translated and you press "Enter" to switch to the next one, it will check the previous segment.

source: 在出版社翻译InDesign文件，一般交给译员一个PDF文档，译员将译文排版成一个Word，然后交给排版人员在InDesign中进行替换。
en: When translating InDesign documents, publishing houses often give the PDF document to the translator. The translator types the translation into a Word and then gives it to the typesetter to replace sources texts with target texts in InDesign.

source: 在原文中选中一个单词后，点击菜单Edit->Show online dictionary dropdown，或者使用快捷键Ctrl+D，会出现包含一串在线词典名字的下拉列表。
en: Select a word in the source text and click menu "Edit->Show online dictionary dropdown" or use shortcut key CTRL+D. A dropdown list of online dictionary names will appear.

source: 在原文右边的编辑框中输入文字即可开始翻译，一个片段完成后按回车切换到下一片段。
en: Input your translation in the right textarea. After one segment's translation is done, press "Enter" to go to the next one.

source: 在所需导出的文件上右键，点击Export to->bi-paragraphs，可以导出双语段落对照文本。
en: Right on the file, click "Export to bi-paragraphs" to do this.

source: 在所需导出的文件上右键，点击Export to->docx for review，可以导出docx文件。
en: Right click on the file and click "Export to docx for review" to export the docx file.

source: 在文件名上右键，点击Import form review。
en: Right click on the file and click "Import from review".

source: 在显示的术语条目上右键，可以查看更多信息和修改历史。
en: Right click on the term item to view more info and its history.

source: 在线词典
en: Online Dictionary

source: 在翻译过程中遇到术语，可以在原文和译文中选中对应的文本，然后点击术语区的Add Term添加术语。
en: When a sentence contains terms, you can select the corresponding texts in the source and the translation to add terms.

source: 在遇到相似的片段时，便会在下方显示。
en: When translating a similar segment, it will appear in the lower area.

source: 基于Git的协作并不同步翻译记忆与术语，只同步工作文件。
en: Collaboration using git will not sync translation memory and terms. It only syncs work files.

source: 基于Git进行团队协作
en: Using Git to collaborate

source: 备份的文件会保存在项目的bak文件夹里。
en: The backup files will be stored in the project's bak folder.

source: 外观设置
en: Appearance Setting

source: 如果PDF的文字可以提取，那可以直接提取出来。
en: If PDF's text can be extracted, it can be extracted directly by pressing the "strip" button.

source: 如果不行，便使用开源的OCR软件tesseract进行识别。
en: If not, the open source OCR software Tesseract will be used.

source: 如果你想使用运行在远程服务器的LanguageTool，可以通过修改链接来调用。
en: You can change the link to use Language Tool running on a remote server.

source: 如果匹配到术语，也可以设置包含进去。
en: Matched terms can also be included.

source: 如果句段属于不同的文件或者翻译单元，将不能进行合并。
en: If two segments belong to different files or translation units, they cannot be merged.

source: 如果您会开发软件，可以帮助开发插件、修改项目代码。
en: If you are a developer, you can develop plugins or make a pull request to improve BasicCAT's code.

source: 如果您会翻译，可以帮助翻译网站、文档以及程序的界面，同样通过提交issues来提交请求。
en: If you want to translate BasicCAT's website, documentation or its interface, you can also open an issue to apply.

source: 如果您在使用过程中碰到问题，或者有什么建议，欢迎在项目的github页面提交issues。
en: If you are a user and come across some issues or have some suggestions, you can open an issue in BasicCAT's github repository.

source: 如果想使用运行在远程服务器的corenlp，可以通过修改链接来调用。
en: Change the link to use a remote server.

source: 如果有错误，会在下方的功能区进行提示，并在输入框位置显示一个备选正确内容的下拉列表。
en: Errors will be shown in the lower area. A dropdown list containing the possible corrections will also be shown below the translation textarea.

source: 如果要同步到远程仓库，还可以设置密码。
en: If you need to sync with remote repositories, you can set a password.

source: 如果要求保留格式却又没有源文件，只能翻译后试着重新排版。
en: If you want to preserve the formats but do not have the source file, you have first translate text and do desktop publishing from anew.

source: 安装Git后，在项目文件夹执行git show可以查看最新一次保存做了哪些修改。
en: You can use git show to see what the latest changes are. You have to install Git on your computer to do this.

source: 完成审校后，可以从Word文件将修改结果导回。
en: When the review is done, you can import the result back.

source: 官网地址：https://stanfordnlp.github.io/CoreNLP/index.html
en: Stanford CoreNLP Homepage: https://stanfordnlp.github.io/CoreNLP/index.html

source: 客户端需要进行相关设置，设置完成后即可实时共享翻译记忆与术语。
en: Relevant settings are needed on the client side.

source: 密钥目前只支持单行内容。
en: The key can be any one-line text.

source: 对于汉译英，还可以用于快速输入英文单词。
en: As for Chinese to English translation, it can also be used to input English words quickly.

source: 导出Word以供审校
en: Export Word for review

source: 导出Word供外部审校
en: Export Word for external review

source: 导出双语对照文本
en: Export bilingual paragraph files

source: 导出双语段落对照文件
en: Export bilingual paragraph files

source: 导出带备注的Markdown文件
en: Export to markdown with notes

source: 封装标签：
en: Encapsulation:

source: 将Word转存为TXT，导入BasicCAT中翻译。
en: Export Word to TXT to translate in BasicCAT.

source: 工具支持添加页码信息，还可以针对InDesign生成的对页进行处理。
en: You can add page number to the extracted text. It can also add facing pages number like Page 4-5.

source: 已经翻译的部分会用译文进行替代。
en: Translated source text will be replaced by translation.

source: 帮助BasicCAT项目发展
en: How to Contribute

source: 常见机器翻译服务的API调用
en: Support Machine Translation Services Provided by Google, Microsoft, etc.

source: 平时在Word里可以设置汉字的加粗是通过软件算法实现的，而IDML中是通过设置字重来实现的。
en: The bold style of Chinese characters in Word is achieved by software algorithm, but IDML uses font weight to do this.

source: 快速入门
en: Getting Started

source: 快速填充
en: Quickfill

source: 快速填充的设置需要点击菜单Project->Project Settings，切换到Quickfill栏目。
en: Click menu "Project->Project Settings" to set up quickfill.

source: 您需要申请翻译API以实现调用，每个机器翻译申请的链接已经附在上面的列表中，其中MyMemory只需要配置一个email地址即可使用。
en: You have to apply for API keys to use these translation services. Links to apply have been included in the MT list above. MyMemory does not require API key and only needs to give an email address.

source: 我们也可以用它来快速输入内容。
en: We can also use it to input content quickly.

source: 我们在Project Files上右键，可以添加文件或者添加文件夹。
en: Right click "Project Files" to add files or add folders.
